## Titanic problem With Machine learning

In [40]:
import pandas as pd
import numpy as np
import os

In [41]:
url='C:\\Users\\vsiripuram\\Desktop\\python\\titanic'
test_file_path= os.path.join(url,'test.csv')
train_file_path= os.path.join(url,'train.csv')

In [42]:
train_df=pd.read_csv(train_file_path,index_col='PassengerId')
test_df=pd.read_csv(test_file_path,index_col='PassengerId')

In [43]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [44]:
type(train_df)

pandas.core.frame.DataFrame

### Basic structure

In [45]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 10 columns):
Pclass      418 non-null int64
Name        418 non-null object
Sex         418 non-null object
Age         332 non-null float64
SibSp       418 non-null int64
Parch       418 non-null int64
Ticket      418 non-null object
Fare        417 non-null float64
Cabin       91 non-null object
Embarked    418 non-null object
dtypes: float64(2), int64(3), object(5)
memory usage: 35.9+ KB

In [46]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Ticket      891 non-null object
Fare        891 non-null float64
Cabin       204 non-null object
Embarked    889 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [47]:
test_df['Survived']=-888

In [48]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 892 to 1309
Data columns (total 11 columns):
Pclass      418 non-null int64
Name        418 non-null object
Sex         418 non-null object
Age         332 non-null float64
SibSp       418 non-null int64
Parch       418 non-null int64
Ticket      418 non-null object
Fare        417 non-null float64
Cabin       91 non-null object
Embarked    418 non-null object
Survived    418 non-null int64
dtypes: float64(2), int64(4), object(5)
memory usage: 39.2+ KB

In [51]:
df=pd.concat((test_df,train_df),axis=0,sort='True')

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 892 to 891
Data columns (total 11 columns):
Age         1046 non-null float64
Cabin       295 non-null object
Embarked    1307 non-null object
Fare        1308 non-null float64
Name        1309 non-null object
Parch       1309 non-null int64
Pclass      1309 non-null int64
Sex         1309 non-null object
SibSp       1309 non-null int64
Survived    1309 non-null int64
Ticket      1309 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 122.7+ KB

In [54]:
df.head()

,Age,Cabin,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket
PassengerId,,,,,,,,,,,
892,34.5,NaN,Q,7.8292,"Kelly, Mr. James",0,3,male,0,-888,330911
893,47.0,NaN,S,7.0000,"Wilkes, Mrs. James (Ellen Needs)",0,3,female,1,-888,363272
894,62.0,NaN,Q,9.6875,"Myles, Mr. Thomas Francis",0,2,male,0,-888,240276
895,27.0,NaN,S,8.6625,"Wirz, Mr. Albert",0,3,male,0,-888,315154
896,22.0,NaN,S,12.2875,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,3,female,1,-888,3101298

In [55]:
df.tail()

,Age,Cabin,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket
PassengerId,,,,,,,,,,,
887,27.0,NaN,S,13.00,"Montvila, Rev. Juozas",0,2,male,0,0,211536
888,19.0,B42,S,30.00,"Graham, Miss. Margaret Edith",0,1,female,0,1,112053
889,NaN,NaN,S,23.45,"Johnston, Miss. Catherine Helen ""Carrie""",2,3,female,1,0,W./C. 6607
890,26.0,C148,C,30.00,"Behr, Mr. Karl Howell",0,1,male,0,1,111369
891,32.0,NaN,Q,7.75,"Dooley, Mr. Patrick",0,3,male,0,0,370376

In [57]:
df.Name

PassengerId
892                                     Kelly, Mr. James
893                     Wilkes, Mrs. James (Ellen Needs)
894                            Myles, Mr. Thomas Francis
895                                     Wirz, Mr. Albert
896         Hirvonen, Mrs. Alexander (Helga E Lindqvist)
897                           Svensson, Mr. Johan Cervin
898                                 Connolly, Miss. Kate
899                         Caldwell, Mr. Albert Francis
900            Abrahim, Mrs. Joseph (Sophie Halaut Easu)
901                              Davies, Mr. John Samuel
902                                     Ilieff, Mr. Ylio
903                           Jones, Mr. Charles Cresson
904        Snyder, Mrs. John Pillsbury (Nelle Stevenson)
905                                 Howard, Mr. Benjamin
906    Chaffee, Mrs. Herbert Fuller (Carrie Constance...
907        del Carlo, Mrs. Sebastiano (Argenia Genovesi)
908                                    Keane, Mr. Daniel
909                                    Assaf, Mr. Gerios
910                         Ilmakangas, Miss. Ida Livija
911                Assaf Khalil, Mrs. Mariana (Miriam")"
912                               Rothschild, Mr. Martin
913                            Olsen, Master. Artur Karl
914                 Flegenheim, Mrs. Alfred (Antoinette)
915                      Williams, Mr. Richard Norris II
916      Ryerson, Mrs. Arthur Larned (Emily Maria Borie)
917                              Robins, Mr. Alexander A
918                         Ostby, Miss. Helene Ragnhild
919                                    Daher, Mr. Shedid
920                              Brady, Mr. John Bertram
921                                    Samaan, Mr. Elias
                             ...
862                          Giles, Mr. Frederick Edward
863    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
864                    Sage, Miss. Dorothy Edith "Dolly"
865                               Gill, Mr. John William
866                             Bystrom, Mrs. (Karolina)
867                         Duran y More, Miss. Asuncion
868                 Roebling, Mr. Washington Augustus II
869                          van Melkebeke, Mr. Philemon
870                      Johnson, Master. Harold Theodor
871                                    Balkic, Mr. Cerin
872     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
873                             Carlsson, Mr. Frans Olof
874                          Vander Cruyssen, Mr. Victor
875                Abelson, Mrs. Samuel (Hannah Wizosky)
876                     Najib, Miss. Adele Kiamie "Jane"
877                        Gustafsson, Mr. Alfred Ossian
878                                 Petroff, Mr. Nedelio
879                                   Laleff, Mr. Kristo
880        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
881         Shelley, Mrs. William (Imanita Parrish Hall)
882                                   Markun, Mr. Johann
883                         Dahlberg, Miss. Gerda Ulrika
884                        Banfield, Mr. Frederick James
885                               Sutehall, Mr. Henry Jr
886                 Rice, Mrs. William (Margaret Norton)
887                                Montvila, Rev. Juozas
888                         Graham, Miss. Margaret Edith
889             Johnston, Miss. Catherine Helen "Carrie"
890                                Behr, Mr. Karl Howell
891                                  Dooley, Mr. Patrick
Name: Name, Length: 1309, dtype: object

In [59]:
df[['Name','Age']]

                                                          Name   Age
PassengerId
892                                           Kelly, Mr. James  34.5
893                           Wilkes, Mrs. James (Ellen Needs)  47.0
894                                  Myles, Mr. Thomas Francis  62.0
895                                           Wirz, Mr. Albert  27.0
896               Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.0
897                                 Svensson, Mr. Johan Cervin  14.0
898                                       Connolly, Miss. Kate  30.0
899                               Caldwell, Mr. Albert Francis  26.0
900                  Abrahim, Mrs. Joseph (Sophie Halaut Easu)  18.0
901                                    Davies, Mr. John Samuel  21.0
902                                           Ilieff, Mr. Ylio   NaN
903                                 Jones, Mr. Charles Cresson  46.0
904              Snyder, Mrs. John Pillsbury (Nelle Stevenson)  23.0
905                                       Howard, Mr. Benjamin  63.0
906          Chaffee, Mrs. Herbert Fuller (Carrie Constance...  47.0
907              del Carlo, Mrs. Sebastiano (Argenia Genovesi)  24.0
908                                          Keane, Mr. Daniel  35.0
909                                          Assaf, Mr. Gerios  21.0
910                               Ilmakangas, Miss. Ida Livija  27.0
911                      Assaf Khalil, Mrs. Mariana (Miriam")"  45.0
912                                     Rothschild, Mr. Martin  55.0
913                                  Olsen, Master. Artur Karl   9.0
914                       Flegenheim, Mrs. Alfred (Antoinette)   NaN
915                            Williams, Mr. Richard Norris II  21.0
916            Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  48.0
917                                    Robins, Mr. Alexander A  50.0
918                               Ostby, Miss. Helene Ragnhild  22.0
919                                          Daher, Mr. Shedid  22.5
920                                    Brady, Mr. John Bertram  41.0
921                                          Samaan, Mr. Elias   NaN
...                                                        ...   ...
862                                Giles, Mr. Frederick Edward  21.0
863          Swift, Mrs. Frederick Joel (Margaret Welles Ba...  48.0
864                          Sage, Miss. Dorothy Edith "Dolly"   NaN
865                                     Gill, Mr. John William  24.0
866                                   Bystrom, Mrs. (Karolina)  42.0
867                               Duran y More, Miss. Asuncion  27.0
868                       Roebling, Mr. Washington Augustus II  31.0
869                                van Melkebeke, Mr. Philemon   NaN
870                            Johnson, Master. Harold Theodor   4.0
871                                          Balkic, Mr. Cerin  26.0
872           Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0
873                                   Carlsson, Mr. Frans Olof  33.0
874                                Vander Cruyssen, Mr. Victor  47.0
875                      Abelson, Mrs. Samuel (Hannah Wizosky)  28.0
876                           Najib, Miss. Adele Kiamie "Jane"  15.0
877                              Gustafsson, Mr. Alfred Ossian  20.0
878                                       Petroff, Mr. Nedelio  19.0
879                                         Laleff, Mr. Kristo   NaN
880              Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0
881               Shelley, Mrs. William (Imanita Parrish Hall)  25.0
882                                         Markun, Mr. Johann  33.0
883                               Dahlberg, Miss. Gerda Ulrika  22.0
884                              Banfield, Mr. Frederick James  28.0
885                                     Sutehall, Mr. Henry Jr  25.0
886                       Rice, Mrs. William (Margaret Norton)  39.0
887                                      Montvila, Rev. Juozas  27.0
888                               Graham, Miss. Margaret Edith  19.0
889                   Johnston, Miss. Catherine Helen "Carrie"   NaN
890                                      Behr, Mr. Karl Howell  26.0
891                                        Dooley, Mr. Patrick  32.0

[1309 rows x 2 columns]

In [61]:
df.loc[5:10]

,Age,Cabin,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket
PassengerId,,,,,,,,,,,
5,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,3,male,0,0,373450
6,NaN,NaN,Q,8.4583,"Moran, Mr. James",0,3,male,0,0,330877
7,54.0,E46,S,51.8625,"McCarthy, Mr. Timothy J",0,1,male,0,0,17463
8,2.0,NaN,S,21.0750,"Palsson, Master. Gosta Leonard",1,3,male,3,0,349909
9,27.0,NaN,S,11.1333,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",2,3,female,0,1,347742
10,14.0,NaN,C,30.0708,"Nasser, Mrs. Nicholas (Adele Achem)",0,2,female,1,1,237736

In [63]:
df.iloc[5:10,3:5]

                Fare                                       Name
PassengerId
897           9.2250                 Svensson, Mr. Johan Cervin
898           7.6292                       Connolly, Miss. Kate
899          29.0000               Caldwell, Mr. Albert Francis
900           7.2292  Abrahim, Mrs. Joseph (Sophie Halaut Easu)
901          24.1500                    Davies, Mr. John Samuel

In [65]:
df.loc[5:10,'Age':'Parch']

,Age,Cabin,Embarked,Fare,Name,Parch
PassengerId,,,,,,
5,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0
6,NaN,NaN,Q,8.4583,"Moran, Mr. James",0
7,54.0,E46,S,51.8625,"McCarthy, Mr. Timothy J",0
8,2.0,NaN,S,21.0750,"Palsson, Master. Gosta Leonard",1
9,27.0,NaN,S,11.1333,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",2
10,14.0,NaN,C,30.0708,"Nasser, Mrs. Nicholas (Adele Achem)",0

In [67]:
df.loc[5:10,['Age','Nmae','Pclass']]

              Age  Nmae  Pclass
PassengerId
5            35.0   NaN       3
6             NaN   NaN       3
7            54.0   NaN       1
8             2.0   NaN       3
9            27.0   NaN       3
10           14.0   NaN       2

the above tow is lable and index based selection

In [73]:
male_passengers=df.loc[df.Sex=='male',:]
print('The number of male passangers :{0}'.format(len(male_passengers)))

The number of male passangers :843

In [94]:
class_passengers=df.loc[(df.Sex=='male') & (df.Pclass==1),:]
print("the number male passengers in the first class :{0}".format(len(class_passengers)))

the number male passengers in the first class :323

### Summary Statistics